sample_list = [5, 7, 12, 3, 15, 2, 1, 15]
id()  # повертає id елемента у пам'яті
len()  # повертає довжину списку.
max()  # повертає найбільший елемент списку.
min()  # повертає найменший елемент списку.
sum()  # повертає суму всіх елементів списку.
sorted()  # повертає відсортований список(не змінює оригінальний список).
reversed()  # повертає список в зворотному порядку(не змінює оригінальний список).

"""
функція filter() повертає новий список, що містить елементи, 
для яких функція function повертає True.
"""
filter(function, sample_list)

""" 
Функція map() повертає новий список, що містить результати 
застосування функції function до кожного елементу списку. 
"""
map(function, sample_list)
